In [1]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Autolabel function for bar graphs
def autolabel(rects, ax):
    # Get y-axis height to calculate label position from.
    (y_bottom, y_top) = ax.get_ylim()
    y_height = y_top - y_bottom
    for rect in rects:
        height = rect.get_height()
        # Fraction of axis height taken up by this rectangle
        p_height = (height / y_height)
        # If we can fit the label above the column, do that;
        # otherwise, put it inside the column.
        if p_height > 0.95: # arbitrary; 95% looked good to me.
            label_position = height - (y_height * 0.05)
        else:
            label_position = height + (y_height * 0.01)
        ax.text(rect.get_x() + rect.get_width()/2., label_position,
                '%d' % int(height),
                ha='center', va='bottom')

In [2]:
path2 ="postgresql+psycopg2://postgres:postgres@localhost/GCA_Homework_dB"
engine2 = create_engine(path2)

In [3]:
#data=engine2.execute("""SELECT * FROM "Salaries" """) 
conn = engine2.connect()
data = pd.read_sql("""SELECT * FROM "Salaries" """, conn)
data2 = pd.read_sql("""SELECT * FROM "Titles" """, conn)

In [4]:
data.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12

In [5]:
data2.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [8]:
# Merge the columns
combined_data = pd.merge(data, data2, on="emp_no", how="inner")
f=combined_data.groupby('title')['salary'].mean()
f

title
Assistant Engineer    48493.204786
Engineer              48539.781423
Manager               51531.041667
Senior Engineer       48506.751806
Senior Staff          58503.286614
Staff                 58465.271904
Technique Leader      48580.505772
Name: salary, dtype: float64

In [ ]:
combined_grouped = combined_data.groupby(["title"])
combined_grouped.head()

In [ ]:
mean=combined_grouped.mean()
mean.style.format({'title': "${:.2f}"})

In [ ]:
combined_data["title"].unique()
mean["emp_no"]

In [ ]:
# Generate the Plot (Accounting for percentages)
import numpy as np
fig, ax = plt.subplots()
x_axis = combined_data["title"].unique()
rects = ax.bar(x_axis, f, width=0.8, color='b')
plt.xticks(rotation=90)
ax.get_ylim()
#Plot data format for easier reading, axes labeling, title, legend location, etc
plt.title("Position vs Mean Salary")
#plt.xlabel("Timepoint")
plt.ylabel("Salary")
#autolabel function used to print labels in the plot
autolabel(rects, ax)
# Save the Figure
plt.savefig("salary_position.png")
fig.set_figheight(7)
fig.set_figwidth(10)
# Show the Figure
plt.show()

In [ ]:
#import matplotlib.pyplot as plt
#import numpy as np
#plt.bar(mean["title"],mean["emp_no"])
#Plot labeling, title, legend location, etc
#plt.xticks(rotation=90)
#plt.title("Salary by title")
#plt.ylim(2.90,4.2)
#plt.xlabel("Title")
#plt.ylabel("Salary")
#plt.show()
#plt.savefig("salary_vs_title.png")